app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "cliff"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_name(params[:name])